# PANDAS
Salah satu Library Python yang digunakan untuk Data Analisis

* Series
* DataFrame
* Missing Data
* Group By
* Operation
* Data Input & Output

### Series

Import Pandas dan Numpy Sebagai Pendukung

In [2]:
import pandas as pd
import numpy as np

Pemberian Nilai dapat diberikan dari data list, numpy array, dictionary

In [3]:
labels = ['a', 'b', 'c']
my_list = [10, 15, 20]
arr = np.array([30, 40, 50])
dic = {'a':1, 'b':2, 'c':3}

Using List

In [4]:
pd.Series(data=my_list)

0    10
1    15
2    20
dtype: int64

In [5]:
pd.Series(data=my_list, index=labels)

a    10
b    15
c    20
dtype: int64

In [6]:
pd.Series(my_list, labels) #pemanggilan harus sesuai urutan | Series(Data, Index)

a    10
b    15
c    20
dtype: int64

Using Numpy Array

In [7]:
pd.Series(data=arr)

0    30
1    40
2    50
dtype: int32

In [8]:
pd.Series(data=arr, index=labels)

a    30
b    40
c    50
dtype: int32

Using Dictionary

In [9]:
pd.Series(data=dic)

a    1
b    2
c    3
dtype: int64

Pandas Series dapat juga diberikan nilai sebuah object

In [10]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [11]:
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

Using a Index

In [12]:
index = pd.Series([1000,3000,2000], index=['Surabaya','Jakarta','Bandung'])
index

Surabaya    1000
Jakarta     3000
Bandung     2000
dtype: int64

In [13]:
#pemanggilan by index

index['Surabaya']

1000

In [13]:
index2 = pd.Series([100,200,50], index=['Surabaya','Jakarta','Semarang'])

Operasi perhitungan dapat dilakukan

In [15]:
index

Surabaya    1000
Jakarta     3000
Bandung     2000
dtype: int64

In [16]:
index2

Surabaya    100
Jakarta     200
Semarang     50
dtype: int64

In [15]:
#Keluaran pada index Bandung dan Semarang bernilai NaN yang berarti
#index tersebut tidak ditemukan pada setiap variable Series

index + index2

Bandung        NaN
Jakarta     3200.0
Semarang       NaN
Surabaya    1100.0
dtype: float64

In [16]:
index * index2

Bandung          NaN
Jakarta     600000.0
Semarang         NaN
Surabaya    100000.0
dtype: float64


# DataFrame

In [18]:
array_value = np.array([[200,300,500],[700,300,1000],[1500,250,250]])
array_value

array([[ 200,  300,  500],
       [ 700,  300, 1000],
       [1500,  250,  250]])

In [74]:
# DataFrame(Nilai, Nama_index, Nama_Kolom)
df = pd.DataFrame(array_value,index=['Timur','Barat','Pusat'],columns=['Surabaya','Jakarta','Bandung'])
df

       Surabaya  Jakarta  Bandung
Timur       200      300      500
Barat       700      300     1000
Pusat      1500      250      250

#### Selection & Indexing

In [19]:
#Pemanggilan berdasarkan kolom | DF_Name_Variable[Kolom]

df['Surabaya']

Timur     200
Barat     700
Pusat    1500
Name: Surabaya, dtype: int32

In [20]:
#Pemanggilan Dua atau Lebih kolom | DF_Name_Variable[[Kolom_1, Kolom_2, ... ,Kolom_N]]

df[['Surabaya','Bandung']]

       Surabaya  Bandung
Timur       200      500
Barat       700     1000
Pusat      1500      250

In [21]:
#pemanggilan berdasarkan kolom dapat dilakukan dengan pemanggailan function tetapi cara ini kurang di anjurkan
#DF_Name_Variable.Kolom

df.Surabaya

Timur     200
Barat     700
Pusat    1500
Name: Surabaya, dtype: int32

In [22]:
#Pemanggilan berdasarkan Baris dengan menggunakan function loc[Nama baris]

df.loc['Timur']

Surabaya    200
Jakarta     300
Bandung     500
Name: Timur, dtype: int32

In [23]:
#Pemanggilan Dua atau lebih Baris menggunakan function Loc[[Baris1, Baris2, .....,BarisN]]

df.loc[['Timur','Barat']]

       Surabaya  Jakarta  Bandung
Timur       200      300      500
Barat       700      300     1000

In [24]:
#pemanggilan berdasarkan Baris dengan menggunakan function iloc[letak_index] yang dimulai dari 0

df.iloc[1]

Surabaya     700
Jakarta      300
Bandung     1000
Name: Barat, dtype: int32

In [24]:
#Pemanggilan Dua atau Lebih Berdasarkan Index
# dengan menggunakan function iloc[letak_index0, letak_index1, ... , letak_index_N]

df.iloc[[0,2]]

       Surabaya  Jakarta  Bandung
Timur       200      300      500
Pusat      1500      250      250

#### Conditonal Selection

In [129]:
df

       Surabaya  Jakarta  Bandung
Timur       200      300      500
Barat       700      300     1000
Pusat      1500      250      250

In [130]:
df >300

       Surabaya  Jakarta  Bandung
Timur     False    False     True
Barat      True    False     True
Pusat      True    False    False

In [131]:
df[df>300]

       Surabaya  Jakarta  Bandung
Timur       NaN      NaN    500.0
Barat     700.0      NaN   1000.0
Pusat    1500.0      NaN      NaN

In [143]:
df[df["Surabaya"]>300]

       Surabaya  Jakarta  Bandung
Barat       700      300     1000
Pusat      1500      250      250

In [141]:
df[df['Surabaya']>300][['Bandung', 'Jakarta']]

       Bandung  Jakarta
Barat     1000      300
Pusat      250      250

In [144]:
df[(df['Surabaya']<500) & (df['Jakarta']>200)]

       Surabaya  Jakarta  Bandung
Timur       200      300      500

#### Menambahkan Kolom Baru

In [75]:
df

       Surabaya  Jakarta  Bandung
Timur       200      300      500
Barat       700      300     1000
Pusat      1500      250      250

In [77]:
# DF_Name_Variable[Kolom_baru] = Values

df['baru'] = df['Surabaya'] + df['Bandung']

In [78]:
df

       Surabaya  Jakarta  Bandung  baru
Timur       200      300      500   700
Barat       700      300     1000  1700
Pusat      1500      250      250  1750

#### Menghapus Kolom

In [79]:
# Menggunakan function drop(Kolom, axis=0/1)
# axis 0 untuk Baris | axis 1 untuk kolom

df.drop('baru', axis=1)

       Surabaya  Jakarta  Bandung
Timur       200      300      500
Barat       700      300     1000
Pusat      1500      250      250

In [80]:
#Data Kolom Baru tidak terhapus secara permanen, hanya menghapus secara tampilan

df

       Surabaya  Jakarta  Bandung  baru
Timur       200      300      500   700
Barat       700      300     1000  1700
Pusat      1500      250      250  1750

In [81]:
# Dengan Parameter inplace yang bernilai True akan menghapus data secara permanen

df.drop('baru', axis=1, inplace=True)
df

       Surabaya  Jakarta  Bandung
Timur       200      300      500
Barat       700      300     1000
Pusat      1500      250      250

In [127]:
# Menambahkan Baris Baru

d2 = pd.DataFrame([[200, 300, 100]], index=["Selatan"], columns=["Surabaya","Bandung","Jakarta"])
df = df.append(d2)

In [104]:
df

         Surabaya  Jakarta  Bandung
Timur         200      300      500
Barat         700      300     1000
Pusat        1500      250      250
Selatan       200      100      300

In [128]:
# Menghapus Baris

df.drop('Selatan', inplace=True)
df

       Surabaya  Jakarta  Bandung
Timur       200      300      500
Barat       700      300     1000
Pusat      1500      250      250

In [145]:
df.reset_index()

   index  Surabaya  Jakarta  Bandung
0  Timur       200      300      500
1  Barat       700      300     1000
2  Pusat      1500      250      250

In [147]:
Id_baru = "Timur Barat Pusat".split()
Id_baru

['Timur', 'Barat', 'Pusat']

In [149]:
df["Kawasan"] = Id_baru
df

       Surabaya  Jakarta  Bandung Kawasan
Timur       200      300      500   Timur
Barat       700      300     1000   Barat
Pusat      1500      250      250   Pusat

In [152]:
# Merubah index menggunakan function set.index('Kolom_yang_dijadikan_index')

df.set_index('Kawasan', inplace=True)

In [153]:
df

         Surabaya  Jakarta  Bandung
Kawasan
Timur         200      300      500
Barat         700      300     1000
Pusat        1500      250      250

#### Multi-Index